tsung_logs/4x1/critical.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="smaller.eba-nex5i8mb.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="3" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="idle_timeout" value="60000"/>
    <option name="global_ack_timeout" value="60000"/>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <request>
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <http url="/"/>
      </request>

      <request>
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <dyn_variable name="authenticity_token"/>
        <http url="/submissions/new"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="999999999">
        <var name="random_submission_name"/>
      </setdynvars>

      <request subst="true">
        <match do="abort" when="nomatch">HTTP/1.1 302</match>
        <dyn_variable name="created_submission_id" re="[Ll]ocation: http://.*/submissions/(.*)\r"/>
        <http contents="authenticity_token=%%_authenticity_token%%&amp;submission%5Btitle%5D=link_%%_random_submission_name%%&amp;submission%5Burl%5D=http%3A%2F%2Fwww.article.com%2F%%_random_submission_name%%&amp;submission%5Bcommunity_id%5D=1&amp;commit=Create+Submission" method="POST" url="/submissions"/>
      </request>

      <request subst="true">
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <http url="/submissions/%%_created_submission_id%%"/>
      </request>
    </session>
  </sessions>
</tsung>